yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c

#include "gagent.h"

#include "simplelink.h"
#include "osi.h"
#include "uart_if.h"

#include "common.h"
#include "timer_if.h"
#include "gpio_if.h"
#include "rom_map.h"

#include "prcm.h"
#include "gpio_if.h"

#include "hw_memmap.h"
#include "wdt.h"
#include "wdt_if.h"



#define GAGENT_CONFIG_FILE "/tmp/gizwitsConfig"
#define GAGENT_HOSTPOTS  "/tmp/hostpots"
#define SH_GPIO_3   (3)  /* P58 - Device Mode */
#define AUTO_CONNECTION_TIMEOUT_COUNT   80      /* ? Sec */
#define SMARTCONFIG_TIMEOUT_COUNT   550      /* 60 Sec */

#define GPIO_LED2 10
static unsigned int LED2Port = 0;
static unsigned char LED2Pin;

extern unsigned long g_ulSeconds;
uint16 *halWiFiStatus=0;
static NetHostList_str gAplist;
extern unsigned long  g_ulStatus;
#define WLAN_SCAN_COUNT         30

Sl_WlanNetworkEntry_t netEntries[30]; // Wlan Network Entry

/* Application specific status/error codes */
typedef enum{
    // Choosing this number to avoid overlap w/ host-driver's error codes
    FILE_ALREADY_EXIST = -0x7D0,
    FILE_CLOSE_ERROR = FILE_ALREADY_EXIST - 1,
    FILE_NOT_MATCHED = FILE_CLOSE_ERROR - 1,
    FILE_OPEN_READ_FAILED = FILE_NOT_MATCHED - 1,
    FILE_OPEN_WRITE_FAILED = FILE_OPEN_READ_FAILED -1,
    FILE_READ_FAILED = FILE_OPEN_WRITE_FAILED - 1,
    FILE_WRITE_FAILED = FILE_READ_FAILED - 1,

    DEVICE_NOT_IN_STATION_MODE = FILE_WRITE_FAILED - 1,

    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

static int8 g_ulMode = 0; // 1:STA 2:AP 3:P2P
static char selectUartFlag = 0; //0:no 1:select
static int8 connectFlag = 0; 
extern unsigned int setApMode;
static int8 airlinkTimes = 0; 

int32  wlanscan(void);
long testSwitchStaMode(void);
static long CC3200_ConfigtoSmartconfig();
static int SmartConfigConnect();

void setMode(int8 mode)
{
    g_ulMode = mode;
}
char getMode()
{
     return g_ulMode;
}

void setselFlag(char flag)
{
     if(1 == flag)
        selectUartFlag = 1;
     else
        selectUartFlag = 0;
}
char getselFlag()
{
     return selectUartFlag;
}

void setconnFlag(int8 flag)
{
    connectFlag = flag;
}
int8 getconnFlag(void)
{
     return connectFlag;
}
#if 1
void setAirlinkTimes(int8 airTimes)
{
    airlinkTimes = airTimes;
}
int8 getAirlinkTimes(void)
{
     return airlinkTimes;
}
#endif
void msleep(int m_seconds)
{ 
    osi_Sleep(m_seconds);
}

void sleep(int seconds)
{ 
    osi_Sleep(seconds*1000);
}

void mdelay(int m_seconds)
{ 
    MAP_UtilsDelay(m_seconds);
}

uint32 GAgent_GetHostByName( int8 *domain, int8 *IPAddress)
{
    long lStatus = 0;
	unsigned long pDestinationIP;
		
    lStatus = sl_NetAppDnsGetHostByName((signed char *) domain,
                                            strlen(domain),
                                            &pDestinationIP, SL_AF_INET);
    if(lStatus < 0)
		return lStatus;

	sprintf(IPAddress, "%d.%d.%d.%d", 
					SL_IPV4_BYTE(pDestinationIP,3),
                    SL_IPV4_BYTE(pDestinationIP,2),
                    SL_IPV4_BYTE(pDestinationIP,1),
                    SL_IPV4_BYTE(pDestinationIP,0));
	
    return lStatus;
	
}

int Gagent_setsocketnonblock(int socketfd)
{
    	long nonBlocking = 1;
       _i32 Status;
#if 0
       sl_SetSockOpt(socketfd, SOL_SOCKET, SO_NONBLOCKING, \
                           &nonBlocking,
                        sizeof(nonBlocking));
#else
        SlSockNonblocking_t enableOption;
        enableOption.NonblockingEnabled = 1;
        Status = sl_SetSockOpt(socketfd,SOL_SOCKET,SO_NONBLOCKING, (u8 *)&enableOption,sizeof(enableOption)); // Enable/disable nonblocking mode
        if( Status < 0 )
        {
            //sl_Close(socketfd);
            //Report("http_connect_server: ERROR sl_SetSockOpt, status=%d\r\n", SockID);
             GAgent_Printf(GAGENT_ERROR, "ERROR sl_SetSockOpt, SO_NONBLOCKING status=%d", Status);
            return -1;
        }
    return 0;
#endif
}

int Gagent_setsocketrectime(int socketfd)
{
#if 0
    struct SlTimeval_t timeVal;
	 //*struct SlTimeval_t timeVal;
    timeVal.tv_sec =  2;             // Seconds
    timeVal.tv_usec = 0;             // Microseconds. 10000 microseconds resolution
    sl_SetSockOpt(socketfd,     // Enable receive timeout
    		      SL_SOL_SOCKET,
    		      SL_SO_RCVTIMEO,
    		      (_u8 *)&timeVal,
    		      sizeof(timeVal));//s*/
#else
        struct SlTimeval_t timeVal;
        _i32 Status;

        timeVal.tv_sec=1;
        timeVal.tv_usec=0;
        Status = sl_SetSockOpt(socketfd, SL_SOL_SOCKET, SL_SO_RCVTIMEO, (_u8 *)&timeVal, sizeof(timeVal));
        if( Status < 0 )
        {
            //sl_Close(socketfd);
            //Report("http_connect_server: ERROR sl_SetSockOpt, status=%d\r\n", SockID);
             GAgent_Printf(GAGENT_ERROR, "ERROR sl_SetSockOpt, status=%d", Status);
            return -1;
        }

        return 0;
#endif
}


uint32 GAgent_GetDevTime_MS()
{
	return g_ulSeconds*1000;
}
uint32 GAgent_GetDevTime_S()
{	return g_ulSeconds;
}
/****************************************************************
FunctionName    :   GAgent_DevReset
Description     :   dev exit but not clean the config data                   
pgc             :   global staruc 
return          :   NULL
Add by Alex.lin     --2015-04-18
****************************************************************/
void GAgent_DevReset()
{
    GAgent_Printf( GAGENT_CRITICAL,"Please restart GAgent !!!\r\n");
    #if 0
    sl_Stop(30); 
    MAP_PRCMHibernateIntervalSet(330);
    MAP_PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);
    MAP_PRCMHibernateEnter();
    #else
  //
  // Configure hibernate RTC wakeup
  //
  PRCMHibernateWakeupSourceEnable(PRCM_HIB_SLOW_CLK_CTR);
  //
  // Delay loop
  //
  MAP_UtilsDelay(8000000);
  //
  // Set wake up time
  //
  PRCMHibernateIntervalSet(330);
  //
  // Request hibernate
  //
  PRCMHibernateEnter();
  //
  // Control should never reach here
  //
  while(1)
  {
  }
  #endif
}

long ResetNwp()
{
#if 0
    long lRetVal = -1;
    /* Restart Network processor */
    lRetVal = sl_Stop(SL_STOP_TIMEOUT);
    
    lRetVal = sl_Start(NULL,NULL,NULL);
    ASSERT_ON_ERROR(lRetVal);
    return lRetVal;
#else
    MAP_UtilsDelay(8000000);
    MAP_PRCMMCUReset(0);
#endif
}


void GAgent_DevInit( pgcontext pgc )
{
     halWiFiStatus = &pgc->rtinfo.GAgentStatus;
}
int8 GAgent_DevGetMacAddress( uint8* szmac )
{
	_u8                 macAddressLen = SL_MAC_ADDR_LEN ;
	_u8					tmpMac[SL_MAC_ADDR_LEN];
	
