yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
	sl_NetCfgGet (SL_MAC_ADDRESS_GET , NULL , &macAddressLen , tmpMac) ;

	sprintf(szmac, "%02x%02x%02x%02x%02x%02x", 
		tmpMac[0], tmpMac[1],tmpMac[2],
		tmpMac[3],tmpMac[4],tmpMac[5]);

	return 0;
}
uint32 GAgent_DevGetConfigData( gconfig *pConfig )
{
    int ret=0;
#if 1
	long lFileHandle;
    unsigned long ulToken;
	long lRetVal = -1;

	    //
    // open a user file for reading
    //
    lRetVal = sl_FsOpen((unsigned char *)GAGENT_CONFIG_FILE,
                        FS_MODE_OPEN_READ,
                        &ulToken,
                        &lFileHandle);
    if(lRetVal < 0)
    {
        lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
        return 0;
    }

	lRetVal = sl_FsRead(lFileHandle,
                    0,
                     (unsigned char *)pConfig, sizeof(gconfig));
    if ((lRetVal < 0) || (lRetVal != sizeof(gconfig)))
    {
    	lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
        return 0;
    }
	
    GAgent_Printf( GAGENT_INFO,"%s %d ",__FUNCTION__,ret );
    sl_FsClose(lFileHandle, 0, 0, 0);
#else
	pConfig->magicNumber = GAGENT_MAGIC_NUM;
	memcpy(pConfig->wifi_ssid, SSID_NAME, strlen(SSID_NAME));
	memcpy(pConfig->wifi_key, SECURITY_KEY, strlen(SECURITY_KEY));
#endif
    return 0;
}
uint32 GAgent_DevSaveConfigData( gconfig *pConfig )
{
	long lRetVal = -1;
	long lFileHandle;
    unsigned long ulToken;
	

    //
    //  create a user file
    //
    lRetVal = sl_FsOpen((unsigned char *)GAGENT_CONFIG_FILE,
                FS_MODE_OPEN_CREATE(2048, \
                          _FS_FILE_OPEN_FLAG_COMMIT|_FS_FILE_PUBLIC_WRITE),
                        &ulToken,
                        &lFileHandle);
    if(lRetVal < 0)
    {
        //
        // File may already be created
        //
        lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
        return lRetVal;
    }
    else
    {
        //
        // close the user file
        //
        lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
        if (SL_RET_CODE_OK != lRetVal)
        {
            return lRetVal;
        }
    }
    
    //
    //  open a user file for writing
    //
    lRetVal = sl_FsOpen((unsigned char *)GAGENT_CONFIG_FILE,
                        FS_MODE_OPEN_WRITE, 
                        &ulToken,
                        &lFileHandle);
    if(lRetVal < 0)
    {
        lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
		
		//
		//	create a user file
		//
		lRetVal = sl_FsOpen((unsigned char *)GAGENT_CONFIG_FILE,
					FS_MODE_OPEN_CREATE(2048, \
							  _FS_FILE_OPEN_FLAG_COMMIT|_FS_FILE_PUBLIC_WRITE),
							&ulToken,
							&lFileHandle);
		if(lRetVal < 0)
		{
			//
			// File may already be created
			//
			lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
			return lRetVal;
		}
		else
		{
			//
			// close the user file
			//
			lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
			if (SL_RET_CODE_OK != lRetVal)
			{
				return lRetVal;
			}
		}

    }
    
    //
    // write "Old MacDonalds" child song as many times to get just below a 64KB file
    //
    lRetVal = sl_FsWrite(lFileHandle,
                    0, 
                    (unsigned char *)pConfig, sizeof(gconfig));
    if (lRetVal < 0)
    {
            lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
            return lRetVal;
    }
    
    
    //
    // close the user file
    //
    lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
    if (SL_RET_CODE_OK != lRetVal)
    {
        return lRetVal;
    }
	
    return 0;
}
void WifiStatusHandler(int event)
{

}

unsigned long ipToNum(int8* ip)
{
	int8* p;
	int sections[4]={0};
	int i=0;
	unsigned long num =0;
	
	p = strtok(ip,".");
	while( p )
	{
		sections[i] = atoi(p);
		p = strtok(NULL,".");
		i++;
	}

	
	for( int j=3,i=0 ; j>=0 ; j--,i++ )
	{
		num += (sections[i] <<(8*j));
	}
	
	return num;
}

int32 GAgent_connect( int32 iSocketId, uint16 port,
                        int8 *ServerIpAddr,int8 flag)
{
    int8 ret= -1;
    unsigned long pDestinationIP;
    int8  tmpSvrip[20];
    
    struct sockaddr_in Msocket_address;
    GAgent_Printf(GAGENT_INFO,"do connect ip:%s port=%d",ServerIpAddr,port );

    memset(&tmpSvrip[0],0,sizeof(tmpSvrip) );
    memcpy(&tmpSvrip[0],ServerIpAddr,strlen(ServerIpAddr));
    pDestinationIP = ipToNum(tmpSvrip);

     GAgent_Printf(GAGENT_INFO,"iptoNumber:%s port=%d, destination=%lld",ServerIpAddr,port, pDestinationIP );

    Msocket_address.sin_family = SL_AF_INET;
    Msocket_address.sin_port= sl_Htons((unsigned short)port);
    Msocket_address.sin_addr.s_addr = sl_Htonl((unsigned int)pDestinationIP); //inet_addr(ServerIpAddr);
    #if 0
    ret = sl_Connect(iSocketId, (struct sockaddr *)&Msocket_address, sizeof( struct sockaddr_in));  
	if(ret >= 0)
	    {
		 Gagent_setsocketnonblock(iSocketId);
              //Gagent_setsocketrectime(iSocketId);
               GAgent_Printf(GAGENT_INFO,"iSocketId(%d), port:%d GAgent_connect success!!",iSocketId,port );
	    }
    #else
    // connecting to TCP server
    long retry = 0;
    while(1)
    {
        ret = sl_Connect(iSocketId, (struct sockaddr *)&Msocket_address, sizeof( struct sockaddr_in));
        if( (ret == SL_EALREADY) && (retry < 5))
        {
            //MAP_UtilsDelay(800000);
            retry++;
	      GAgent_Printf(GAGENT_ERROR, "sl_Connect SL_EALREADY retry=%d", retry);
        }
        else if( ret < 0 )
        {
            // error
            //sl_Close(iSocketId);
	     GAgent_Printf(GAGENT_ERROR, "sl_Connect connect failed!");
            break;
        }
        else
        {
            Gagent_setsocketnonblock(iSocketId);
            Gagent_setsocketrectime(iSocketId);
            GAgent_Printf(GAGENT_INFO,"iSocketId(%d), port:%d GAgent_connect success!!",iSocketId,port );
            break;
        }
    }
    #endif
    return ret;
}


//return the new wifimode 
int8 GAgent_DRVSetWiFiStartMode( pgcontext pgc,uint32 mode )
{
    return ( pgc->gc.flag +=mode );
}
void DRV_ConAuxPrint( char *buffer, int len, int level )
{
    
