yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
    buffer[len]='\0';
}
int32 GAgent_OpenUart( int32 BaudRate,int8 number,int8 parity,int8 stopBits,int8 flowControl )
{
	return 0;
}
void GAgent_LocalDataIOInit( pgcontext pgc )
{
    return ;
}

static int ConfigureMode(int iMode, const int8* ap_name,const int8 *ap_password)
{
    char secType = SL_SEC_TYPE_WPA_WPA2;//SL_SEC_TYPE_WPA_WPA2;
    long   lRetVal = -1;
    unsigned char ucConfigOpt = 0;
    unsigned char ucConfigLen = 0;
    unsigned char ucPower = 0;

    
    UART_PRINT("%s, %d \n", __FUNCTION__,__LINE__);
  
    lRetVal = sl_WlanSetMode(iMode);
    if(lRetVal < 0)
    {
       ASSERT_ON_ERROR(lRetVal);
       return 0; 
    }

    lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_SSID, strlen(ap_name),
                            (unsigned char*)ap_name);
    if(lRetVal < 0)
    {
       ASSERT_ON_ERROR(lRetVal);
       return 0; 
    }
    
    lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_PASSWORD, strlen(ap_password),
                            (unsigned char*)ap_password);
    if(lRetVal < 0)
    {
       ASSERT_ON_ERROR(lRetVal);
       return 0; 
    }
    
    lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_SECURITY_TYPE, 1,
                            (unsigned char*)&secType);
    if(lRetVal < 0)
    {
       ASSERT_ON_ERROR(lRetVal);
       return 0; 
    }

        #if 0
    

  
      SlNetCfgIpV4Args_t ipV4;
    ipV4.ipV4          = (_u32)SL_IPV4_VAL(10,10,100,254);            // _u32 IP address 
    ipV4.ipV4Mask      = (_u32)SL_IPV4_VAL(255,255,255,0);         // _u32 Subnet mask for this AP/P2P
    ipV4.ipV4Gateway   = (_u32)SL_IPV4_VAL(10,10,100,254);              // _u32 Default gateway address
    ipV4.ipV4DnsServer = (_u32)SL_IPV4_VAL(10,10,100,254);            // _u32 DNS server address
    //sl_NetCfgSet(SL_IPV4_AP_P2P_GO_STATIC_ENABLE,IPCONFIG_MODE_ENABLE_IPV4,sizeof(SlNetCfgIpV4Args_t),(_u8*)&ipV4);
    ASSERT_ON_ERROR(sl_NetCfgSet(SL_IPV4_AP_P2P_GO_STATIC_ENABLE, IPCONFIG_MODE_ENABLE_IPV4,
                                     sizeof(SlNetCfgIpV4Args_t), (_u8 *)&ipV4));
    
     SlNetAppDhcpServerBasicOpt_t dhcpParams= {0}; 
    _u8 outLen = sizeof(SlNetAppDhcpServerBasicOpt_t); 
    dhcpParams.lease_time      = 4096;                         // lease time (in seconds) of the IP Address
    dhcpParams.ipv4_addr_start =  SL_IPV4_VAL(10,10,100,252);   // first IP Address for allocation. IP Address should be set as Hex number - i.e. 0A0B0C01 for (10.11.12.1)
    dhcpParams.ipv4_addr_last  =  SL_IPV4_VAL(10,10,100,254);   // last IP Address for allocation. IP Address should be set as Hex number - i.e. 0A0B0C01 for (10.11.12.1)
    //sl_NetAppStop(SL_NET_APP_DHCP_SERVER_ID);                  // Stop DHCP server before settings
    //sl_NetAppSet(SL_NET_APP_DHCP_SERVER_ID, NETAPP_SET_DHCP_SRV_BASIC_OPT, outLen, (_u8* )&dhcpParams);  // set parameters
    //sl_NetAppStart(SL_NET_APP_DHCP_SERVER_ID);
    ASSERT_ON_ERROR(sl_NetAppStop(SL_NET_APP_DHCP_SERVER_ID));      // Stop DHCP server before settings
    ASSERT_ON_ERROR(sl_NetAppSet(SL_NET_APP_DHCP_SERVER_ID, NETAPP_SET_DHCP_SRV_BASIC_OPT,
                                     sizeof(SlNetAppDhcpServerBasicOpt_t), (_u8* )&dhcpParams));  // set parameters
    //ASSERT_ON_ERROR(sl_NetAppStart(SL_NET_APP_DHCP_SERVER_ID));     // Start DHCP server with new settings
    ASSERT_ON_ERROR(sl_NetAppStart(SL_NET_APP_DHCP_SERVER_ID));     // Start DHCP server with new settings
    #else
     SlNetCfgIpV4Args_t ipV4;
    ipV4.ipV4          = (_u32)SL_IPV4_VAL(192,168,1,1);            // _u32 IP address 
    ipV4.ipV4Mask      = (_u32)SL_IPV4_VAL(255,255,255,0);         // _u32 Subnet mask for this AP/P2P
    ipV4.ipV4Gateway   = (_u32)SL_IPV4_VAL(192,168,1,1);              // _u32 Default gateway address
    ipV4.ipV4DnsServer = (_u32)SL_IPV4_VAL(192,168,1,1);            // _u32 DNS server address
    sl_NetCfgSet(SL_IPV4_AP_P2P_GO_STATIC_ENABLE,IPCONFIG_MODE_ENABLE_IPV4,sizeof(SlNetCfgIpV4Args_t),(_u8*)&ipV4);
    #endif


    /* Restart Network processor */
    lRetVal = sl_Stop(SL_STOP_TIMEOUT);

    // reset status bits
    CLR_STATUS_BIT_ALL(g_ulStatus);

    lRetVal = sl_Start(NULL,NULL,NULL);
    if(lRetVal < 0)
    {
       ASSERT_ON_ERROR(lRetVal);
       return 0; 
    }

        #if 0   //Nik.chen for test
   
    //Stop Internal HTTP Server
    lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
    if(lRetVal < 0)
    {
        UART_PRINT("Failed to sl_NetAppStop HTTP_SERVER \n\r");
        LOOP_FOREVER();
    }
#endif


    UART_PRINT("Device is configured in AP mode, lRetVal=%d\n\r", lRetVal);
    setMode(lRetVal);
    return lRetVal;
}

int16 GAgent_DRV_WiFi_SoftAPModeStart( const int8* ap_name,const int8 *ap_password,int16 wifiStatus )
{
    long   lRetVal = -1;
    unsigned char ucDHCP;
     //
    // Configure the networking mode and ssid name(for AP mode)
    //
    if(getMode() != ROLE_AP)
   // if(ROLE_AP!= sl_Start(NULL,NULL,NULL))
    {
        if(getMode() == ROLE_STA)
            wlanscan();
        if(ConfigureMode(ROLE_AP, ap_name, ap_password) != ROLE_AP)
        {
            UART_PRINT("Unable to set AP mode, exiting Application...\n\r");
            sl_Stop(SL_STOP_TIMEOUT);
            LOOP_FOREVER();
        }

        while(!IS_IP_ACQUIRED(g_ulStatus))
        {
          //looping till ip is acquired
        }
    } 

   
#if 1   //Nik.chen for test
   
    //Stop Internal HTTP Server
    lRetVal = sl_NetAppStop(SL_NET_APP_HTTP_SERVER_ID);
    if(lRetVal < 0)
    {
        UART_PRINT("Failed to sl_NetAppStop HTTP_SERVER \n\r");
        LOOP_FOREVER();
    }
#endif

    unsigned char len = sizeof(SlNetCfgIpV4Args_t);
    SlNetCfgIpV4Args_t ipV4 = {0};

    // get network configuration
    lRetVal = sl_NetCfgGet(SL_IPV4_AP_P2P_GO_GET_INFO,&ucDHCP,&len,
                            (unsigned char *)&ipV4);
    if (lRetVal < 0)
    {
        UART_PRINT("Failed to get network configuration \n\r");
        LOOP_FOREVER();
    }

    UART_PRINT("IP %d.%d.%d.%d MASK %d.%d.%d.%d GW %d.%d.%d.%d DNS %d.%d.%d.%d\n",                                                             
        SL_IPV4_BYTE(ipV4.ipV4,3),SL_IPV4_BYTE(ipV4.ipV4,2),SL_IPV4_BYTE(ipV4.ipV4,1),SL_IPV4_BYTE(ipV4.ipV4,0), 
        SL_IPV4_BYTE(ipV4.ipV4Mask,3),SL_IPV4_BYTE(ipV4.ipV4Mask,2),SL_IPV4_BYTE(ipV4.ipV4Mask,1),SL_IPV4_BYTE(ipV4.ipV4Mask,0),         
        SL_IPV4_BYTE(ipV4.ipV4Gateway,3),SL_IPV4_BYTE(ipV4.ipV4Gateway,2),SL_IPV4_BYTE(ipV4.ipV4Gateway,1),SL_IPV4_BYTE(ipV4.ipV4Gateway,0),                 
        SL_IPV4_BYTE(ipV4.ipV4DnsServer,3),SL_IPV4_BYTE(ipV4.ipV4DnsServer,2),SL_IPV4_BYTE(ipV4.ipV4DnsServer,1),SL_IPV4_BYTE(ipV4.ipV4DnsServer,0));
    
    UART_PRINT("WIFI_MODE_AP successfully!!\n\r");
    GAgent_DevCheckWifiStatus( WIFI_MODE_AP,1 );
    setMode(2);
    #if 0
    while(!IS_IP_LEASED(g_ulStatus))
    {
      //wating for the client to connect
    }
    #endif
    return WIFI_MODE_AP;
}

void GAgent_DRVWiFi_APModeStop( pgcontext pgc )
{
    long lRetVal = -1;  
    lRetVal = ConfigureSimpleLinkToDefaultState();
    if(lRetVal < 0)
    {
        if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
        {
            UART_PRINT("Failed to configure the device in its default state\n\r");
        }

