yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
        LOOP_FOREVER();
    }
    GAgent_Printf( GAGENT_INFO,"ToDo SoftAp Stop!");
}

int CC3200_SwitchSTAMode(void)
{ 
#if 1
          long lRetVal = -1;
         unsigned int uiConnectTimeoutCnt =0;

        while(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT &&
        ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))))  
        { 
            // Toggle LEDs to Indicate Connection Progress
            GPIO_IF_LedOff(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            GPIO_IF_LedOn(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            uiConnectTimeoutCnt++;
        }

        CLR_STATUS_BIT_ALL(g_ulStatus);
      
         UART_PRINT("CC3200_SwitchSTAMode uiConnectTimeoutCnt =%d!!! \n\r", uiConnectTimeoutCnt);
#else
        long lRetVal = -1;
         unsigned char ucVal = 1;
      
         lRetVal = sl_WlanDisconnect();
        if(0 == lRetVal)
        {
            // Wait
            while(IS_CONNECTED(g_ulStatus))
            {
            #ifndef SL_PLATFORM_MULTI_THREADED
                  _SlNonOsMainLoopTask(); 
            #endif
            }
        }

        // Switch to STA role and restart 
        lRetVal = sl_WlanSetMode(ROLE_STA);
         if (lRetVal < 0)
        {
            UART_PRINT("Failed to get network configuration \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

        // Enable DHCP client
        lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Stop(0xFF);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Stop failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

        lRetVal = sl_Start(NULL, NULL, NULL);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Start failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

        // Check if the device is in station again 
        if (ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not coming up in STA-mode 
            ASSERT_ON_ERROR(DEVICE_NOT_IN_STATION_MODE);
             LOOP_FOREVER();
        }
         UART_PRINT("CC3200_SwitchSTAMode switch to STA OK!!! \n\r");
         //setMode(lRetVal);
   
        GAgent_DevReset();

             lRetVal = sl_WlanDisconnect();
        if(0 == lRetVal)
        {
            // Wait
            while(IS_CONNECTED(g_ulStatus))
            {
            #ifndef SL_PLATFORM_MULTI_THREADED
                  _SlNonOsMainLoopTask(); 
            #endif
            }
        }

        lRetVal = sl_Start(NULL, NULL, NULL);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Start failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

           GAgent_DevReset();
#endif
}

int16 GAgent_DRVWiFi_StationCustomModeStart(int8 *StaSsid,int8 *StaPass,uint16 wifiStatus )
{
    SlSecParams_t secParams = {0};
    long lRetVal = -1;
     unsigned char policyVal;
     SlVersionFull   ver = {0};
    _WlanRxFilterOperationCommandBuff_t  RxFilterIdMask = {0};
     unsigned int uiConnectTimeoutCnt =0;

    unsigned char ucVal = 1;
    unsigned char ucConfigOpt = 0;
    unsigned char ucConfigLen = 0;
    unsigned char ucPower = 0;

    #if 1
     if(ROLE_STA!= getMode())
    // if(ROLE_STA!= sl_Start(NULL,NULL,NULL))
    { 
        long lRetVal = -1;

         GAgent_DevReset();
      
        // If the device is in AP mode, we need to wait for this event 
        // before doing anything 
        while(!IS_IP_ACQUIRED(g_ulStatus))
        {
#ifndef SL_PLATFORM_MULTI_THREADED
          _SlNonOsMainLoopTask(); 
#endif
        }

        // Switch to STA role and restart 
        lRetVal = sl_WlanSetMode(ROLE_STA);
         if (lRetVal < 0)
        {
            UART_PRINT("Failed to get network configuration \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

        lRetVal = sl_Stop(0xFF);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Stop failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

        lRetVal = sl_Start(NULL, NULL, NULL);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Start failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

        // Check if the device is in station again 
        if (ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not coming up in STA-mode 
            ASSERT_ON_ERROR(DEVICE_NOT_IN_STATION_MODE);
             LOOP_FOREVER();
        }
         UART_PRINT("switch to STA OK!!! \n\r");
        GAgent_DevReset();
     }
    #endif
#if 1
    if((NULL == (signed char*)StaPass)&&(NULL == (signed char*)StaSsid))
    {
          // Enable DHCP client
        lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
        ASSERT_ON_ERROR(lRetVal);
#if 0  //Nik.chen mark or not?
         // Disable scan
    ucConfigOpt = SL_SCAN_POLICY(0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
    ASSERT_ON_ERROR(lRetVal);
#endif

        // Set Tx power level for station mode
        // Number between 0-15, as dB offset from max power - 0 will set max power
        ucPower = 0;
        lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID, 
                WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
        ASSERT_ON_ERROR(lRetVal);

        // Set PM policy to normal
        lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
        ASSERT_ON_ERROR(lRetVal);

        // Unregister mDNS services
        lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
        ASSERT_ON_ERROR(lRetVal);

