yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
        // Remove  all 64 filters (8*8)
        memset(RxFilterIdMask.FilterIdMask, 0xFF, 8);
        lRetVal = sl_WlanRxFilterSet(SL_REMOVE_RX_FILTER, (_u8 *)&RxFilterIdMask,
                           sizeof(_WlanRxFilterOperationCommandBuff_t));
        ASSERT_ON_ERROR(lRetVal);
    
         //set AUTO policy
        lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION,SL_CONNECTION_POLICY(1,0,0,0,0),&policyVal, 1 /*PolicyValLen*/);    
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Stop(SL_STOP_TIMEOUT);

        lRetVal = sl_Start(NULL, NULL, NULL);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Start failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

          //waiting for the device to Auto Connect
        while(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT &&
        ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))))  
        { 
            // Toggle LEDs to Indicate Connection Progress
            GPIO_IF_LedOff(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            GPIO_IF_LedOn(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            uiConnectTimeoutCnt++;
        }
         //Couldn't connect Using Auto Profile
        if(uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT)
        {
            //Blink Red LED to Indicate Connection Error
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);
            CLR_STATUS_BIT_ALL(g_ulStatus);
            #if 0
            //Connect Using Smart Config
            lRetVal = SmartConfigConnect();
            ASSERT_ON_ERROR(lRetVal);
            #else
            UART_PRINT("connect timeout, before is smartconfig mode!!! \n\r");
            //GAgent_DevCheckWifiStatus( WIFI_MODE_ONBOARDING,1 );
             lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION , \
                                SL_CONNECTION_POLICY(1,1,0,0,0), 0, 0); //Nik.chen for test delete or not?
             if(lRetVal<0)
            {
                UART_PRINT("sl_WlanPolicySet failed!!! \n\r");
            }
            #endif
        }

         //set AUTO policy
        lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION,SL_CONNECTION_POLICY(1,0,0,0,0),&policyVal, 1 /*PolicyValLen*/);    
        ASSERT_ON_ERROR(lRetVal);
    }
    else
    {
         #if 0
          lRetVal = sl_WlanDisconnect();
        if(0 == lRetVal)
        {
            // Wait
            while(IS_CONNECTED(g_ulStatus))
            {
            #ifndef SL_PLATFORM_MULTI_THREADED
                  _SlNonOsMainLoopTask(); 
            #endif
            }
        }
        #endif

        // Enable DHCP client
        lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
        ASSERT_ON_ERROR(lRetVal);

        // Set Tx power level for station mode
        // Number between 0-15, as dB offset from max power - 0 will set max power
        ucPower = 0;
        lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID, 
                WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
        ASSERT_ON_ERROR(lRetVal);

        // Set PM policy to normal
        lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
        ASSERT_ON_ERROR(lRetVal);

        // Unregister mDNS services
        lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
        ASSERT_ON_ERROR(lRetVal);

        // Remove  all 64 filters (8*8)
        memset(RxFilterIdMask.FilterIdMask, 0xFF, 8);
        lRetVal = sl_WlanRxFilterSet(SL_REMOVE_RX_FILTER, (_u8 *)&RxFilterIdMask,
                           sizeof(_WlanRxFilterOperationCommandBuff_t));
        ASSERT_ON_ERROR(lRetVal);
    
        secParams.Key = (signed char*)StaPass;
        secParams.KeyLen = strlen(StaPass);
        secParams.Type = SECURITY_TYPE;

        lRetVal = sl_WlanProfileAdd((signed char*)StaSsid, strlen(StaSsid),0,&secParams,0,1,0);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_WlanProfileAdd failed!!! \n\r");
        }

         #if 1
         if(0 == wifiStatus)
         {
                lRetVal = sl_Stop(SL_STOP_TIMEOUT);
                if (lRetVal < 0 ) 
                {
                    UART_PRINT("Failed to sl_Stop the device \n\r");
                    LOOP_FOREVER();
                }
                
                 lRetVal = sl_Start(0, 0, 0); //
                if (lRetVal < 0 ||( ROLE_STA != lRetVal)) 
                {
                    UART_PRINT("Failed to sl_Start the device \n\r");
                    LOOP_FOREVER();
                }
         }
         #endif


         //set AUTO policy
        lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION,SL_CONNECTION_POLICY(1,0,0,0,0),&policyVal, 1 /*PolicyValLen*/);    
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_WlanConnect((signed char*)StaSsid, strlen(StaSsid), 0, &secParams, 0);
        while(lRetVal < 0&&(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT))
        {
        UART_PRINT("sl_Start failed, try again!!! \n\r");
         // Toggle LEDs to Indicate Connection Progress
        GPIO_IF_LedOff(MCU_IP_ALLOC_IND);
        MAP_UtilsDelay(800000);
        GPIO_IF_LedOn(MCU_IP_ALLOC_IND);
        MAP_UtilsDelay(800000);
        uiConnectTimeoutCnt++;
        lRetVal = sl_WlanConnect((signed char*)StaSsid, strlen(StaSsid), 0, &secParams, 0);
        }

        uiConnectTimeoutCnt = 0;

           //waiting for the device to Auto Connect
        while(uiConnectTimeoutCnt<AUTO_CONNECTION_TIMEOUT_COUNT &&
        ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))))  
        { 
            // Toggle LEDs to Indicate Connection Progress
            GPIO_IF_LedOff(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            GPIO_IF_LedOn(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            uiConnectTimeoutCnt++;
        }
      
        UART_PRINT("uiConnectTimeoutCnt =%d!!! \n\r", uiConnectTimeoutCnt);

         //Couldn't connect Using Auto Profile
        if(uiConnectTimeoutCnt == AUTO_CONNECTION_TIMEOUT_COUNT)
        {
            //Blink Red LED to Indicate Connection Error
            GPIO_IF_LedOn(MCU_RED_LED_GPIO);    
            CLR_STATUS_BIT_ALL(g_ulStatus);
            #if 0
            //Connect Using Smart Config
            lRetVal = SmartConfigConnect();
            ASSERT_ON_ERROR(lRetVal);
            #else
            UART_PRINT("connect timeout, before is softAP config!!! \n\r");
            setconnFlag(2); 
            //GAgent_DevCheckWifiStatus( WIFI_MODE_ONBOARDING,1 );
            #endif
        }

