yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
        // if(0 == wifiStatus)
          //  setconnFlag(2); 
    }
    #endif

     //Turn RED LED Off
    GPIO_IF_LedOff(MCU_RED_LED_GPIO);

    return WIFI_MODE_STATION;
}
int16 GAgent_DRVWiFi_StationDisconnect(void)
{
         long lRetVal = -1;

       //  lRetVal = sl_Start(0, 0, 0);
        
         lRetVal = sl_WlanDisconnect();
    if(0 == lRetVal)
    {
        // Wait
        while(IS_CONNECTED(g_ulStatus))
        {
       #ifndef SL_PLATFORM_MULTI_THREADED
               _SlNonOsMainLoopTask(); 
        #endif
        }
    }
    
        lRetVal = sl_Stop(0xFF);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(lRetVal);

        // Check if the device is in station again 
        if (ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not coming up in STA-mode 
            ASSERT_ON_ERROR(DEVICE_NOT_IN_STATION_MODE);
        }
    
    return 0;
}
void GAgent_DevTick( )
{
	uint32 dTime=0;

	WatchdogIntClear(WDT_BASE);

    return;
}
void GAgent_DevLED_Red( uint8 onoff )
{

}
void GAgent_DevLED_Green( uint8 onoff )
{

}
int Socket_sendto(int sockfd, u8 *data, int len, void *addr, int addr_size)
{
    return sendto(sockfd, data, len, 0, (const struct sockaddr*)addr, addr_size);
}
int Socket_accept(int sockfd, void *addr, int *addr_size)
{
    return accept(sockfd, (struct sockaddr*)addr, (SlSocklen_t *)addr_size);
}
int Socket_recvfrom(int sockfd, u8 *buffer, int len, void *addr, int *addr_size)
{
    return recvfrom(sockfd, buffer, len, 0, (struct sockaddr *)addr, (SlSocklen_t *)addr_size);
}
int connect_mqtt_socket(int iSocketId, struct sockaddr_t *Msocket_address, unsigned short port, char *MqttServerIpAddr)
{
    return 0;

}
int8 GAgent_OpenAirlink( int32 timeout_s )
{
      long lRetVal = -1;
	
     lRetVal =CC3200_ConfigtoSmartconfig(); 
     if (lRetVal < 0)
    {
        UART_PRINT("CC3200_ConfigtoSmartconfig failed!!! \n\r");
         return lRetVal;
    }

     CLR_STATUS_BIT_ALL(g_ulStatus);

      /* Connect to our AP using SmartConfig method */
   lRetVal = SmartConfigConnect();
   if(lRetVal < 0)
   {
     //UART_PRINT("GAgent_OpenAirlink failed!!! \n\r");
         return lRetVal;
   }  

    GAgent_Printf( GAGENT_CRITICAL,"GAgent_OpenAirlink success !!!\r\n");
     return lRetVal;
}
void GAgent_AirlinkResult( pgcontext pgc )
{
    pgc->gc.flag |=XPG_CFG_FLAG_CONFIG;
    setMode(0);
    setconnFlag(1);
    return ;
}

 int32 wlanscan(void)
{
   
    long lRetVal = -1;
    int32  i=0;
    int32 byteSize=0;
    long lFileHandle;
    unsigned long ulToken;
	

    unsigned short ucIndex;
    unsigned char ucpolicyOpt;
    union
    {
        unsigned char ucPolicy[4];
        unsigned int uiPolicyLen;
    }policyVal;
  

    //
    // Assumption is that the device is configured in station mode already
    // and it is in its default state
    //
    #if 0 //Nik.chen delete or not?
    lRetVal = sl_Start(0, 0, 0); //Nik.chen tinking to delete or not?
    if (lRetVal < 0 ) //|| ROLE_STA != lRetVal
    {
        UART_PRINT("Failed to start the device \n\r");
        return lRetVal;
    }

    UART_PRINT("Device started as STATION \n\r");
    #endif

    //
    // make sure the connection policy is not set (so no scan is run in the
    // background)
    //
    ucpolicyOpt = SL_CONNECTION_POLICY(0, 0, 0, 0,0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION , ucpolicyOpt, NULL, 0);
    if(lRetVal != 0)
    {
        GPIO_IF_LedOn(MCU_EXECUTE_FAIL_IND);
        UART_PRINT("Unable to clear the Connection Policy\n\r");
        return lRetVal;
    }
    
    //
    // enable scan 
    //
    ucpolicyOpt = SL_SCAN_POLICY(1);
    //
    // set scan cycle to 10 seconds 
    //
    policyVal.uiPolicyLen = 10;
    //
    // set scan policy - this starts the scan 
    //
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucpolicyOpt,
                               (unsigned char*)(policyVal.ucPolicy), sizeof(policyVal));
    if(lRetVal!=0)
    {
        GPIO_IF_LedOn(MCU_EXECUTE_FAIL_IND);
        UART_PRINT("Unable to set the Scan Policy\n\r");
        return lRetVal;
    }
    MAP_UtilsDelay(8000000);
    //
    // get scan results - all 20 entries in one transaction 
    //
    ucIndex = 0;
    //
    // retVal indicates the valid number of entries 
    // The scan results are occupied in netEntries[] 
    //
    lRetVal = sl_WlanGetNetworkList(ucIndex, (unsigned char)WLAN_SCAN_COUNT,
                                    &netEntries[ucIndex]);
    if(lRetVal==0)
    {
        GPIO_IF_LedOn(MCU_EXECUTE_FAIL_IND);
        UART_PRINT("Unable to retreive the network list\n\r");
        return lRetVal;
    }
    /* put a break point here and check netEntries[] value for scan ssid list */
    //
    // get scan results - 4 transactions of 5 entries 
    //
    ucIndex = 0;
    memset(netEntries, 0, sizeof(netEntries));

    do
    {
        lRetVal = sl_WlanGetNetworkList(ucIndex,
                                        (unsigned char)WLAN_SCAN_COUNT/4,
                                        &netEntries[ucIndex]);
        ucIndex += lRetVal;
    }
    while ((lRetVal == WLAN_SCAN_COUNT/4) && (ucIndex < WLAN_SCAN_COUNT));

     if( (gAplist.ApList) == NULL )
    {
	GAgent_Printf( GAGENT_CRITICAL,"Malloc buf for ApHostList...");
	//free( gAplist.ApList );

	gAplist.ApNum = WLAN_SCAN_COUNT;
	byteSize = (gAplist.ApNum)*sizeof(ApHostList_str);
	gAplist.ApList = (ApHostList_str *)malloc( byteSize );
	  GAgent_Printf( GAGENT_CRITICAL,"NUM=%d size:%d",gAplist.ApNum ,byteSize );
    }
    else
    {
    	gAplist.ApNum = WLAN_SCAN_COUNT;
    }
    
  
    if( (gAplist.ApList)==NULL )
    {
         UART_PRINT("gAplist.ApList hasn't malloced buffer!!!\n\r");
        return FAILURE;
    }
    
    memset( (gAplist.ApList),0,byteSize );

    for( i=0;i<gAplist.ApNum;i++ )
    {
        strcpy( (char*)gAplist.ApList[i].ssid,(netEntries[i].ssid) );
        gAplist.ApList[i].ApPower = netEntries[i].rssi;
    }
    for( i=0;i<gAplist.ApNum;i++ )
    {
        GAgent_Printf( GAGENT_CRITICAL,"SSID = %s power = %d", gAplist.ApList[i].ssid,
                                                          gAplist.ApList[i].ApPower );

