yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
    }

    #if 1
    //
    //  create a user file
    //
    lRetVal = sl_FsOpen((unsigned char *)GAGENT_HOSTPOTS,
                FS_MODE_OPEN_CREATE(1024, \
                          _FS_FILE_OPEN_FLAG_COMMIT|_FS_FILE_PUBLIC_WRITE),
                        &ulToken,
                        &lFileHandle);
    if(lRetVal < 0)
    {
        //
        // File may already be created
        //
        lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
        return lRetVal;
    }
    else
    {
        //
        // close the user file
        //
        lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
        if (SL_RET_CODE_OK != lRetVal)
        {
            return lRetVal;
        }
    }
    
    //
    //  open a user file for writing
    //
    lRetVal = sl_FsOpen((unsigned char *)GAGENT_HOSTPOTS,
                        FS_MODE_OPEN_WRITE, 
                        &ulToken,
                        &lFileHandle);
    if(lRetVal < 0)
    {
        lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
		
		//
		//	create a user file
		//
		lRetVal = sl_FsOpen((unsigned char *)GAGENT_HOSTPOTS,
					FS_MODE_OPEN_CREATE(1024, \
							  _FS_FILE_OPEN_FLAG_COMMIT|_FS_FILE_PUBLIC_WRITE),
							&ulToken,
							&lFileHandle);
		if(lRetVal < 0)
		{
			//
			// File may already be created
			//
			lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
			return lRetVal;
		}
		else
		{
			//
			// close the user file
			//
			lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
			if (SL_RET_CODE_OK != lRetVal)
			{
				return lRetVal;
			}
		}

    }
    
    //
    // write "Old MacDonalds" child song as many times to get just below a 64KB file
    //
    lRetVal = sl_FsWrite(lFileHandle,
                    0, 
                    (unsigned char *)&gAplist, sizeof(NetHostList_str));
    if (lRetVal < 0)
    {
            lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
            return lRetVal;
    }
    
    
    //
    // close the user file
    //
    lRetVal = sl_FsClose(lFileHandle, 0, 0, 0);
    if (SL_RET_CODE_OK != lRetVal)
    {
        return lRetVal;
    }
    #endif
    
    /* put a break point here and check netEntries[] value for scan ssid list */
    //
    // disable scan 
    //
    ucpolicyOpt = SL_SCAN_POLICY(0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucpolicyOpt, NULL, 0);
    if(lRetVal != 0)
    {
        GPIO_IF_LedOn(MCU_EXECUTE_FAIL_IND);
        UART_PRINT("Unable to Clear the Scan Policy\n\r");
        return lRetVal;
    }

    GPIO_IF_LedOn(MCU_EXECUTE_SUCCESS_IND);
    UART_PRINT("SUCCESS\n\r");

    return SUCCESS;
}

void GAgent_DRVWiFiStartScan( )
{
#if 0
     static int32 stime=0;
    if( ( stime%3 )==0 )
    {
      stime++;
      GAgent_Printf( GAGENT_CRITICAL,"GAgent_DRVWiFiStartScan->wlanscan...");
      wlanscan();
    }
#else
    wlanscan();
#endif
}
void GAgent_DRVWiFiStopScan( )
{

}

NetHostList_str *GAgentDRVWiFiScanResult( NetHostList_str *aplist )
{
     if( gAplist.ApNum==0 )
     	{
     	GAgent_Printf( GAGENT_INFO,"%s %d",__FUNCTION__,__LINE__ );
        return NULL;
     	}
    aplist  = &(gAplist);
    return  aplist;
}

void GAgent_DRVWiFiPowerScan( pgcontext pgc )
{
    wlanscan(); //Nik.chen mark for test
}

/****************************************************************
FunctionName    :   GAgent_DRVWiFiPowerResult
pgc             :   global struct;
returen         :   0-100.max:100.
Add by Alex.lin     --2015-05-26
****************************************************************/
int8 GAgent_DRVWiFiPowerScanResult( pgcontext pgc )
{
    int32 i=0;
    NetHostList_str *pAplist=NULL;
    pAplist = GAgentDRVWiFiScanResult( pAplist );
    if( pAplist->ApNum<=0||pAplist==NULL )
        return 0;
    #if 0
    for( i=0;i<pAplist->ApNum;i++ )
    {
        
       GAgent_Printf( GAGENT_CRITICAL,"SSID = %s power = %d", pAplist->ApList[i].ssid,
                                                           pAplist->ApList[i].ApPower );
    }
    #endif
    for( i=0;i<pAplist->ApNum;i++ )
    {
        if( 0==memcmp(pAplist->ApList[i].ssid,pgc->gc.wifi_ssid,strlen(pgc->gc.wifi_ssid)) )
        {
            return pAplist->ApList[i].ApPower;
        }
    }
    
    return 0;
}

int8 GAgent_DRVBootConfigWiFiMode( void )
{
     //STA Mode
    return ROLE_STA; 
}

int8 GAgent_DRVGetWiFiMode(pgcontext pgc)
{
    int8 ret =0;
    int8 ssidlen=0,keylen=0;
    ssidlen = strlen( pgc->gc.wifi_ssid );
    keylen = strlen( pgc->gc.wifi_key );
    GAgent_Printf( GAGENT_INFO,"SSIDLEN=%d, keyLEN=%d, default mode=%d ",ssidlen,keylen, getMode());

    if(2 == getMode())
    {
        ret = ROLE_AP;
    }
    
    if(( ssidlen>0 && ssidlen<=SSID_LEN_MAX) && keylen<=WIFIKEY_LEN_MAX )
    {
        pgc->gc.flag |= XPG_CFG_FLAG_CONNECTED;
         ret = ROLE_STA;
    }
    else
    {
        memset( pgc->gc.wifi_ssid,0,SSID_LEN_MAX+1 );
        memset( pgc->gc.wifi_key,0,WIFIKEY_LEN_MAX+1 );
        pgc->gc.flag &=~ XPG_CFG_FLAG_CONNECTED;
        ret = ROLE_AP;
    }

    if(0x53 == pgc->gc.airkiss_value)
    {
        pgc->gc.flag |= XPG_CFG_FLAG_CONNECTED;
         ret = ROLE_STA;
    }

    if(0x77 == pgc->gc.airkiss_value)
    {
         ret = ROLE_STA;
    }

    GAgent_DevSaveConfigData( &(pgc->gc) );
    GAgent_DevGetConfigData( &(pgc->gc) );

#if 0
    static unsigned char modeCout = 0;

    if(modeCout++ == 0)
       return ROLE_AP;
    else
       return ROLE_STA;
#elif defined(P58_VCC)
       unsigned int uiGPIOPort;
    unsigned char pucGPIOPin;
    unsigned char ucPinValue;
       
        //Read GPIO
    GPIO_IF_GetPortNPin(SH_GPIO_3,&uiGPIOPort,&pucGPIOPin);
    ucPinValue = GPIO_IF_Get(SH_GPIO_3,uiGPIOPort,pucGPIOPin);

    // return ROLE_STA;

    //If Connected to VCC, Mode is AP
    if(ucPinValue == 1)
    {
      //AP Mode
        GAgent_Printf(GAGENT_DEBUG,"set to AP mode!!! \n");
        ret = ROLE_AP;
    }
   
