yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
#elif defined(LEDSTATUS)
    unsigned char ucLEDStatus = 0;
    GPIO_IF_GetPortNPin(GPIO_LED2, &LED2Port, &LED2Pin);
    ucLEDStatus = GPIO_IF_Get(GPIO_LED2, LED2Port, LED2Pin);
    
    GAgent_Printf(GAGENT_DEBUG,"ucLEDStatus =%d!!! \n", ucLEDStatus);

    if(ucLEDStatus == 1)
    {
        GPIO_IF_GetPortNPin(GPIO_LED2, &LED2Port, &LED2Pin);
        GPIO_IF_Set(GPIO_LED2, LED2Port, LED2Pin, 0);
        ucLEDStatus = GPIO_IF_Get(GPIO_LED2, LED2Port, LED2Pin);
        //AP Mode
        GAgent_Printf(GAGENT_DEBUG,"set to AP mode, ucLEDStatus =%d!!! \n", ucLEDStatus);
        ret = ROLE_AP;
    }

    GPIO_IF_Set(GPIO_LED2, LED2Port, LED2Pin, 0);
#else
     if(setApMode== 1)
    {
         setApMode = 0;
         //AP Mode
        GAgent_Printf(GAGENT_DEBUG,"set to AP mode!!! \n");
        ret = ROLE_AP;
    }
#endif


    #if 1
     GAgent_Printf( GAGENT_INFO,"ssid=%s, key=%s, mode=%d\n ", pgc->gc.wifi_ssid,pgc->gc.wifi_key, ret);
     GAgent_Printf(GAGENT_DEBUG,"GAgent M2M IP :%s \n",pgc->gc.m2m_ip );
    GAgent_Printf(GAGENT_DEBUG,"GAgent GService IP :%s \n",pgc->gc.GServer_ip );
    #endif
    return ret;
}

static long CC3200_ConfigtoSmartconfig()
{
    SlSecParams_t secParams = {0};
    long lRetVal = -1;
     SlVersionFull   ver = {0};
    _WlanRxFilterOperationCommandBuff_t  RxFilterIdMask = {0};

    unsigned char ucVal = 1;
    unsigned char ucConfigOpt = 0;
    unsigned char ucConfigLen = 0;
    unsigned char ucPower = 0;

    UART_PRINT("CC3200_ConfigtoSmartconfig enter!!! \n\r");

    #if 1
     if(0 == getAirlinkTimes())
    {
	 if(ROLE_STA!= sl_Start(NULL,NULL,NULL) )
	{ 
	    UART_PRINT("sl_Start enter!!! \n\r");
	    // If the device is in AP mode, we need to wait for this event 
	    // before doing anything 
	    while(!IS_IP_ACQUIRED(g_ulStatus))
	    {
#ifndef SL_PLATFORM_MULTI_THREADED
	      _SlNonOsMainLoopTask(); 
#endif
	    }
	 }
    }

	  setAirlinkTimes(1);

        // Switch to STA role and restart 
        lRetVal = sl_WlanSetMode(ROLE_STA);
         if (lRetVal < 0)
        {
            UART_PRINT("Failed to get network configuration \n\r");
            ASSERT_ON_ERROR(lRetVal);
             return lRetVal;
        }

          lRetVal = sl_Stop(0xFF);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Stop failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            LOOP_FOREVER();
        }

        lRetVal = sl_Start(NULL, NULL, NULL);
         if (lRetVal < 0)
        {
            UART_PRINT("sl_Start failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
             return lRetVal;
        }

        // Check if the device is in station again 
        if (ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not coming up in STA-mode 
            ASSERT_ON_ERROR(DEVICE_NOT_IN_STATION_MODE);
              return lRetVal;
        }

         GAgent_DevCheckWifiStatus( WIFI_MODE_AP,0 );
         UART_PRINT("Smartconfig switch to STA OK!!! \n\r");

//}
    #endif
    #if 1
    // Get the device's version-information
    ucConfigOpt = SL_DEVICE_GENERAL_VERSION;
    ucConfigLen = sizeof(ver);
    lRetVal = sl_DevGet(SL_DEVICE_GENERAL_CONFIGURATION, &ucConfigOpt, 
                                &ucConfigLen, (unsigned char *)(&ver));
     if(lRetVal < 0)
    {
            UART_PRINT("sl_DevGet failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }
    
    UART_PRINT("Host Driver Version: %s\n\r",SL_DRIVER_VERSION);
    UART_PRINT("Build Version %d.%d.%d.%d.31.%d.%d.%d.%d.%d.%d.%d.%d\n\r",
    ver.NwpVersion[0],ver.NwpVersion[1],ver.NwpVersion[2],ver.NwpVersion[3],
    ver.ChipFwAndPhyVersion.FwVersion[0],ver.ChipFwAndPhyVersion.FwVersion[1],
    ver.ChipFwAndPhyVersion.FwVersion[2],ver.ChipFwAndPhyVersion.FwVersion[3],
    ver.ChipFwAndPhyVersion.PhyVersion[0],ver.ChipFwAndPhyVersion.PhyVersion[1],
    ver.ChipFwAndPhyVersion.PhyVersion[2],ver.ChipFwAndPhyVersion.PhyVersion[3]);
#if 1
    // Set connection policy to Auto + SmartConfig 
    //      (Device's default connection policy)
    lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION, 
                                SL_CONNECTION_POLICY(1, 0, 0, 0, 1), NULL, 0);
    if(lRetVal < 0)
    {
            UART_PRINT("sl_WlanPolicySet failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }

    // Remove all profiles
    lRetVal = sl_WlanProfileDel(0xFF);
    if(lRetVal < 0)
    {
            UART_PRINT("sl_WlanProfileDel failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  
#endif
    //
    // Device in station-mode. Disconnect previous connection if any
    // The function returns 0 if 'Disconnected done', negative number if already
    // disconnected Wait for 'disconnection' event if 0 is returned, Ignore 
    // other return-codes
    //

       lRetVal = sl_WlanDisconnect();
    if(0 == lRetVal)
    {
        // Wait
        while(IS_CONNECTED(g_ulStatus))
        {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask(); 
#endif
        }
    }

    // Enable DHCP client
    lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE,1,1,&ucVal);
    if(lRetVal < 0)
    {
            UART_PRINT("sl_NetCfgSet failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  

    // Disable scan
    ucConfigOpt = SL_SCAN_POLICY(0);
    lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN , ucConfigOpt, NULL, 0);
    if(lRetVal < 0)
    {
            UART_PRINT("sl_NetCfgSet failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  

    // Set Tx power level for station mode
    // Number between 0-15, as dB offset from max power - 0 will set max power
    ucPower = 0;
    lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID, 
            WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *)&ucPower);
     if(lRetVal < 0)
    {
            UART_PRINT("sl_WlanSet failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  

    // Set PM policy to normal
    lRetVal = sl_WlanPolicySet(SL_POLICY_PM , SL_NORMAL_POLICY, NULL, 0);
      if(lRetVal < 0)
    {
            UART_PRINT("sl_WlanPolicySet failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  

