yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
    // Unregister mDNS services
    lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
     if(lRetVal < 0)
    {
            UART_PRINT("sl_NetAppMDNSUnRegisterService failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  

    // Remove  all 64 filters (8*8)
    memset(RxFilterIdMask.FilterIdMask, 0xFF, 8);
    lRetVal = sl_WlanRxFilterSet(SL_REMOVE_RX_FILTER, (_u8 *)&RxFilterIdMask,
                       sizeof(_WlanRxFilterOperationCommandBuff_t));
      if(lRetVal < 0)
    {
            UART_PRINT("sl_WlanRxFilterSet failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  

    lRetVal = sl_Stop(0xFF);
     if(lRetVal < 0)
    {
            UART_PRINT("sl_Stop failed!!! \n\r");
            ASSERT_ON_ERROR(lRetVal);
            return lRetVal;
    }  
    #endif

    lRetVal = sl_Start(NULL, NULL, NULL);
     if (lRetVal < 0)
    {
        UART_PRINT("sl_Start failed!!! \n\r");
        ASSERT_ON_ERROR(lRetVal);
         return lRetVal;
    }
    
    return  lRetVal;
}


//*****************************************************************************
//
//! \brief Connecting to a WLAN Accesspoint using SmartConfig provisioning
//!
//! Enables SmartConfig provisioning for adding a new connection profile
//! to CC3200. Since we have set the connection policy to Auto, once
//! SmartConfig is complete, CC3200 will connect automatically to the new
//! connection profile added by smartConfig.
//!
//! \param[in]                     None
//!
//! \return                        None
//!
//! \note
//!
//! \warning                    If the WLAN connection fails or we don't
//!                             acquire an IP address, We will be stuck in this
//!                             function forever.
//
//*****************************************************************************
int SmartConfigConnect()
{
    unsigned char policyVal;
    long lRetVal = -1;
    unsigned int uiConnectTimeoutCnt =0;

    // Clear all profiles 
    // This is of course not a must, it is used in this example to make sure
    // we will connect to the new profile added by SmartConfig
    //
    lRetVal = sl_WlanProfileDel(0xFF);
    ASSERT_ON_ERROR(lRetVal);

     //Set connection policy to Auto + SmartConfig 
    lRetVal = sl_WlanPolicySet(  SL_POLICY_CONNECTION,
                      SL_CONNECTION_POLICY(1,0,0,0,1),
                      &policyVal,
                      1 /*PolicyValLen*/);
    ASSERT_ON_ERROR(lRetVal);

    // Start SmartConfig
    // This example uses the unsecured SmartConfig method
    //
    lRetVal = sl_WlanSmartConfigStart(0,                /*groupIdBitmask*/
                           SMART_CONFIG_CIPHER_NONE,    /*cipher*/
                           0,                           /*publicKeyLen*/
                           0,                           /*group1KeyLen*/
                           0,                           /*group2KeyLen */
                           NULL,                        /*publicKey */
                           NULL,                        /*group1Key */
                           NULL);                       /*group2Key*/
    ASSERT_ON_ERROR(lRetVal);

    UART_PRINT("SmartConfigConnect waiting!!! \n\r");

#if 0
    // Wait for WLAN Event
    while((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus)))
    {
        #ifndef SL_PLATFORM_MULTI_THREADED
          _SlNonOsMainLoopTask(); 
        #endif
    }
#else
        //waiting for the device to Auto Connect
        while(uiConnectTimeoutCnt<SMARTCONFIG_TIMEOUT_COUNT &&
        ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))))  
        { 
            // Toggle LEDs to Indicate Connection Progress
            GPIO_IF_LedOff(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            GPIO_IF_LedOn(MCU_IP_ALLOC_IND);
            MAP_UtilsDelay(800000);
            uiConnectTimeoutCnt++;
        }
         //Couldn't connect Using Auto Profile
        if(uiConnectTimeoutCnt == SMARTCONFIG_TIMEOUT_COUNT)
        {
            CLR_STATUS_BIT_ALL(g_ulStatus);
            #if 0
            //Connect Using Smart Config
            lRetVal = SmartConfigConnect();
            ASSERT_ON_ERROR(lRetVal);
            #else
            //GAgent_DRV_WiFi_SoftAPModeStart( pgContextData->minfo.ap_name,AP_PASSWORD,0 );
            UART_PRINT("waiting timeout, SmartConfig failed!!! \n\r");
             return FAILURE;
            #endif
        }else
            UART_PRINT("SmartConfig received ssid and key!!! \n\r");
#endif

     //
     // Turn ON the RED LED to indicate connection success
     //
     GPIO_IF_LedOn(MCU_RED_LED_GPIO);
     //wait for few moments
     MAP_UtilsDelay(80000000);
     //reset to default AUTO policy
     lRetVal = sl_WlanPolicySet(  SL_POLICY_CONNECTION,
                           SL_CONNECTION_POLICY(1,0,0,0,0),
                           &policyVal,
                           1 /*PolicyValLen*/);
     ASSERT_ON_ERROR(lRetVal);

     return SUCCESS;
}

#if 1
void CC3200_ReconAP(int8 *StaSsid,int8 *StaPass)
{
    SlSecParams_t secParams = {0};
    long lRetVal = -1;
    
     lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION , \
                                SL_CONNECTION_POLICY(1,1,0,0,0), 0, 0);
    if(lRetVal<0)
    {
        UART_PRINT("sl_WlanPolicySet failed!!! \n\r");
        return;  
    }
    
    secParams.Key = (signed char*)StaPass;
    secParams.KeyLen = strlen(StaPass);
    secParams.Type = SECURITY_TYPE;

    lRetVal = sl_WlanConnect((signed char*)StaSsid, strlen(StaSsid), 0, &secParams, 0);

    if(lRetVal<0)
        UART_PRINT("reconnectAP failed!!! \n\r");
    else
        UART_PRINT("reconnectAP success!!! \n\r");
}

void CC3200_ReconAP_Smartconfig(void)
{
    long lRetVal = -1;
    unsigned char policyVal;
    #if 0
     /* Set connection policy to Fast, Device will connect to last connected AP.
     * This feature can be used to reconnect to AP */
    lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION , \
                                SL_CONNECTION_POLICY(1,1,0,0,0), 0, 0);
     if(lRetVal<0)
    {
        UART_PRINT("sl_WlanPolicySet failed!!! \n\r");
        return;  
    }

