yhpan0613/SimpleLink-CC3200/example/cc3200_gizwits/gagent/arch/CC3200/adapter_cc3200.c
    /* Connect to the open AP */
    lRetVal = sl_WlanConnect((signed char*)StaSsid, strlen(StaSsid), 0, 0, 0);
    if(lRetVal<0)
        UART_PRINT("CC3200_ReconAP_Smartconfig failed!!! \n\r");
    else
        UART_PRINT("CC3200_ReconAP_Smartconfig success!!! \n\r");

      //set AUTO policy
    lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION,
                      SL_CONNECTION_POLICY(1,0,0,0,0),
                      &policyVal, 1 /*PolicyValLen*/); 
     if(lRetVal<0)
    {
        UART_PRINT("sl_WlanPolicySet failed!!! \n\r");
        return;  
    }

    lRetVal = sl_Start(NULL,NULL,NULL);
     if(lRetVal<0)
    {
        UART_PRINT("sl_Start failed!!! \n\r");
        return;  
    }
    #endif

     lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION , \
                                SL_CONNECTION_POLICY(1,1,0,0,0), 0, 0); //Nik.chen for test delete or not?
     if(lRetVal<0)
    {
        UART_PRINT("sl_WlanPolicySet failed!!! \n\r");
        return;  
    }

   
    
}
long testSwitchStaMode()
{ 
        long lRetVal = -1;
      
        // If the device is in AP mode, we need to wait for this event 
        // before doing anything 
        while(!IS_IP_ACQUIRED(g_ulStatus))
        {
#ifndef SL_PLATFORM_MULTI_THREADED
          _SlNonOsMainLoopTask(); 
#endif
        }

        // Switch to STA role and restart 
        lRetVal = sl_WlanSetMode(ROLE_STA);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Stop(0xFF);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(lRetVal);

        // Check if the device is in station again 
        if (ROLE_STA != lRetVal)
        {
            // We don't want to proceed if the device is not coming up in STA-mode 
            ASSERT_ON_ERROR(DEVICE_NOT_IN_STATION_MODE);
             LOOP_FOREVER();
        }
}
#endif
